In [1]:
from sqlalchemy import create_engine
import pandas as pd
import getpass  # To get the password without showing the input
password = getpass.getpass()

········

In [26]:
# this is the general syntax 'dialect+driver://username:password@host:port/database'
# to create the connection string

connection_string = 'mysql+pymysql://root:' + password + '@localhost/bank' #database I want to query
engine = create_engine(connection_string) #then you can use engine.command() further
data = pd.read_sql_query('SELECT * FROM sakila.rentals_may', engine)
data.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [27]:
data.shape

(1183, 7)

In [33]:
# Check the number of rentals for each customer for May
query='select customer_id, count(rental_id) as sum_rentals from sakila.rentals_may \
group by customer_id \
order by customer_id asc'
data_may = pd.read_sql_query(query, engine)
data_may.head()

   customer_id  sum_rentals
0            1            2
1            2            1
2            3            2
3            5            3
4            6            3

In [34]:
# this is the general syntax 'dialect+driver://username:password@host:port/database'
# to create the connection string

connection_string = 'mysql+pymysql://root:' + password + '@localhost/bank' #database I want to query
engine = create_engine(connection_string) #then you can use engine.command() further
data_june = pd.read_sql_query('SELECT * FROM sakila.rentals_june', engine)
data_june.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1158,2005-06-14 22:53:33,1632,416,2005-06-18 21:37:33,2,2006-02-15 21:30:53
1,1159,2005-06-14 22:55:13,4395,516,2005-06-17 02:11:13,1,2006-02-15 21:30:53
2,1160,2005-06-14 23:00:34,2795,239,2005-06-18 01:58:34,2,2006-02-15 21:30:53
3,1161,2005-06-14 23:07:08,1690,285,2005-06-21 17:12:08,1,2006-02-15 21:30:53
4,1162,2005-06-14 23:09:38,987,310,2005-06-23 22:00:38,1,2006-02-15 21:30:53

In [35]:
# Check the number of rentals for each customer for June
query='select customer_id, count(rental_id) as sum_rentals from sakila.rentals_june \
group by customer_id \
order by sum_rentals desc'
data_june = pd.read_sql_query(query, engine)
data_june.head()

   customer_id  sum_rentals
0           31           13
1          526           11
2          454           11
3          329           10
4          295           10

Write a function that checks if customer borrowed more or less books in the month of June as compared to May.
For this part, you can create a join between the two dataframes created before, using the merge function available for pandas dataframes.

In [72]:
#function for info of each customer

def rental_info(df3,col):
    x=int(input("Customer_ID:"))
    if df3[col][x]>0:
        print("The customer {} rented more in May".format(x))
    elif df3[col][x]==0:
        print("The customer {} rented same amount in May and in June".format(x))
    elif df3[col][x]<0:
        print("The customer {} rented more in June".format(x))

In [77]:
#check rentals 
def rentals(df1,df2,how,on_column,col):#on_column,how =str
    #merge df1 and df2
    df3=df1.merge(right=df2,how=how,left_on=on_column,right_on=on_column)
    
    #rename columns
    df3.columns=col
    
    #reseting index
    df3=df3.set_index(col[0])
    
    #creating the difference
    df3["diff"]=df3[col[1]]-df3[col[2]]
    
    rental_info(df3,"diff")
    
    return df3

In [78]:
col=['customer_id','rentals_may','rentals_june']

In [79]:
test=rentals(data_may,data_june,"inner","customer_id",col)

Customer_ID:6
The customer 6 rented more in June

In [76]:
test.head()

             rentals_may  rentals_june  diff
customer_id
1                      2             7    -5
2                      1             1     0
3                      2             4    -2
5                      3             6    -3
6                      3             5    -2